Router>
Router>
Router>
Router>
Router>
Router>en
Router#
Router#enable
Router#config ter
Router#config terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#
Router(config)#hostname HQ
HQ(config)#
HQ(config)#
HQ(config)#ip
% Incomplete command.
HQ(config)#
HQ(config)#int fa0/0
HQ(config-if)#ip address 192.168.1.129 255.255.255.192
HQ(config-if)#no shut
HQ(config-if)#no shutdown 

HQ(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

HQ(config-if)#
HQ(config-if)#exit
HQ(config)#
HQ(config)#int s0/0/0
HQ(config-if)#ip address 192.168.1.225 255.255.255.252
HQ(config-if)#no sh
HQ(config-if)#no shutdown 

%LINK-5-CHANGED: Interface Serial0/0/0, changed state to down
HQ(config-if)#
HQ(config-if)#no shutdown 
HQ(config-if)#exit
HQ(config)#
HQ(config)#int s0/0/1
HQ(config-if)#
HQ(config-if)#ip address 192.168.1.229 255.255.255.252
HQ(config-if)#clo
HQ(config-if)#clock ra
HQ(config-if)#clock rate 64000
HQ(config-if)#no 
HQ(config-if)#no sh
HQ(config-if)#no shutdown 

%LINK-5-CHANGED: Interface Serial0/0/1, changed state to down
HQ(config-if)#
HQ(config-if)#exit
HQ(config)#
HQ(config)# line console 0
HQ(config-line)#pass
HQ(config-line)#password cisco
HQ(config-line)#login
HQ(config-line)#exit
HQ(config)#line vty 0
HQ(config-line)#pass
HQ(config-line)#password cisco
HQ(config-line)#login
HQ(config-line)#exit
HQ(config)#en
HQ(config)#ena
HQ(config)#enable sec
HQ(config)#enable secret class
HQ(config)#
HQ(config)#exit
HQ#
%SYS-5-CONFIG_I: Configured from console by console

HQ#
HQ#
HQ#copy run
HQ#copy running-config st
HQ#copy running-config startup-config 
Destination filename [startup-config]? 
Building configuration...
[OK]
HQ#
HQ#
HQ#
HQ#


===============================================

